NordicSemiconductor/nrfx/mdk/iar_startup_nrf54h20_engb_flpr.s
        PUBWEAK  VPRCLIC_18_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_18_IRQHandler
        j .

        PUBWEAK  VPRCLIC_19_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_19_IRQHandler
        j .

        PUBWEAK  VPRCLIC_20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_20_IRQHandler
        j .

        PUBWEAK  VPRCLIC_21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_21_IRQHandler
        j .

        PUBWEAK  VPRCLIC_22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_22_IRQHandler
        j .

        PUBWEAK  VPRCLIC_23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_23_IRQHandler
        j .

        PUBWEAK  VPRCLIC_24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_24_IRQHandler
        j .

        PUBWEAK  VPRCLIC_25_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_25_IRQHandler
        j .

        PUBWEAK  VPRCLIC_26_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_26_IRQHandler
        j .

        PUBWEAK  VPRCLIC_27_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_27_IRQHandler
        j .

        PUBWEAK  VPRCLIC_28_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_28_IRQHandler
        j .

        PUBWEAK  VPRCLIC_29_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_29_IRQHandler
        j .

        PUBWEAK  VPRCLIC_30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_30_IRQHandler
        j .

        PUBWEAK  VPRCLIC_31_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_31_IRQHandler
        j .

        PUBWEAK  VPRTIM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRTIM_IRQHandler
        j .

        PUBWEAK  GPIOTE130_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_0_IRQHandler
        j .

        PUBWEAK  GPIOTE130_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_1_IRQHandler
        j .

        PUBWEAK  GRTC_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_0_IRQHandler
        j .

        PUBWEAK  GRTC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_1_IRQHandler
        j .

        PUBWEAK  GRTC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_2_IRQHandler
        j .

        PUBWEAK  TBM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TBM_IRQHandler
        j .

        PUBWEAK  USBHS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBHS_IRQHandler
        j .

        PUBWEAK  EXMIF_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXMIF_IRQHandler
        j .

        PUBWEAK  IPCT120_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT120_0_IRQHandler
        j .

        PUBWEAK  I3C120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C120_IRQHandler
        j .

        PUBWEAK  VPR121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR121_IRQHandler
        j .

        PUBWEAK  CAN120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CAN120_IRQHandler
        j .

        PUBWEAK  MVDMA120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA120_IRQHandler
        j .

        PUBWEAK  I3C121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C121_IRQHandler
        j .

        PUBWEAK  TIMER120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER120_IRQHandler
        j .

        PUBWEAK  TIMER121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER121_IRQHandler
        j .

        PUBWEAK  PWM120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM120_IRQHandler
        j .

        PUBWEAK  SPIS120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIS120_IRQHandler
        j .

        PUBWEAK  SPIM120_UARTE120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM120_UARTE120_IRQHandler
        j .

        PUBWEAK  SPIM121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM121_IRQHandler
        j .

        PUBWEAK  VPR130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR130_IRQHandler
        j .

        PUBWEAK  IPCT130_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT130_0_IRQHandler
        j .

        PUBWEAK  RTC130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC130_IRQHandler
        j .

        PUBWEAK  RTC131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC131_IRQHandler
        j .

        PUBWEAK  WDT131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT131_IRQHandler
        j .

        PUBWEAK  WDT132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT132_IRQHandler
        j .

        PUBWEAK  EGU130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU130_IRQHandler
        j .

        PUBWEAK  SAADC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SAADC_IRQHandler
        j .

        PUBWEAK  COMP_LPCOMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
COMP_LPCOMP_IRQHandler
        j .

        PUBWEAK  TEMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TEMP_IRQHandler
        j .

        PUBWEAK  NFCT_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
NFCT_IRQHandler
        j .

        PUBWEAK  TDM130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TDM130_IRQHandler
        j .

        PUBWEAK  PDM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM_IRQHandler
        j .

        PUBWEAK  QDEC130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QDEC130_IRQHandler
        j .

        PUBWEAK  QDEC131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QDEC131_IRQHandler
        j .

        PUBWEAK  TDM131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TDM131_IRQHandler
        j .

        PUBWEAK  TIMER130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER130_IRQHandler
        j .

        PUBWEAK  TIMER131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER131_IRQHandler
        j .

